## Pandas Day - 12

## concate() Function 
**`concat()`** is a Pandas function used to combine multiple DataFrames or Series along rows or columns.

In [2]:
import pandas as pd

### Creating Sample series

In [4]:
sr1=pd.Series([1,2,3,4,5,6,7])

In [5]:
sr2=pd.Series([8,9,10,11])

### Concatenate series

In [6]:
pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
4     5
5     6
6     7
0     8
1     9
2    10
3    11
dtype: int64

### Creating Sample DataFrames

In [14]:
df1 = pd.DataFrame({
    "Name": ["Amit", "Rahul"],
    "Age": [21, 22]
})
df1

    Name  Age
0   Amit   21
1  Rahul   22

In [16]:
df2 = pd.DataFrame({
    "Name": ["Neha", "Priya"],
    "Age": [20, 23]
})
df2

    Name  Age
0   Neha   20
1  Priya   23

### Concatenate Rows (axis=0)

In [17]:
df_row = pd.concat([df1, df2])
df_row

    Name  Age
0   Amit   21
1  Rahul   22
0   Neha   20
1  Priya   23

### Concatenate Columns (axis=1)

In [20]:
pd.concat([df1,df2],axis=1)

    Name  Age   Name  Age
0   Amit   21   Neha   20
1  Rahul   22  Priya   23

### Reset Index after Concatenation

In [19]:
df_row_reset = pd.concat([df1, df2], ignore_index=True)
df_row_reset

    Name  Age
0   Amit   21
1  Rahul   22
2   Neha   20
3  Priya   23

### Concatenate with join

In [23]:
pd.concat([df1,df2],axis=1,join='inner')

    Name  Age   Name  Age
0   Amit   21   Neha   20
1  Rahul   22  Priya   23

In [24]:
pd.concat([df1,df2],axis=1,join='outer')

    Name  Age   Name  Age
0   Amit   21   Neha   20
1  Rahul   22  Priya   23

### Using Keys

In [27]:
pd.concat([df1, df2], keys = ['df1','df2'],axis=1)

     df1        df2
    Name Age   Name Age
0   Amit  21   Neha  20
1  Rahul  22  Priya  23

In [28]:
pd.concat([df1, df2], keys = ['First df','second df'],axis=1)

  First df     second df
      Name Age      Name Age
0     Amit  21      Neha  20
1    Rahul  22     Priya  23

In [29]:
df3 = pd.DataFrame({'Marks': [40, 63, 91, 34]})
df3

   Marks
0     40
1     63
2     91
3     34

In [30]:
pd.concat([df1,df3],axis=1)

    Name   Age  Marks
0   Amit  21.0     40
1  Rahul  22.0     63
2    NaN   NaN     91
3    NaN   NaN     34

In [31]:
pd.concat([df1,df3],axis=0)

    Name   Age  Marks
0   Amit  21.0    NaN
1  Rahul  22.0    NaN
0    NaN   NaN   40.0
1    NaN   NaN   63.0
2    NaN   NaN   91.0
3    NaN   NaN   34.0

### Conclusion
The concat() function is used to combine DataFrames along rows or columns.